OpenFOAM-v2112-AD/applications/discreteAdjointOpenFOAM/test/pitzDaily/system/decomposeParDict

// * * * * * * * * * //
FoamFile
{
	version 0.5;
	format ascii;
	root "ROOT";
	case "CASE";
	class dictionary;
	object nix;
}
method simple;
numberOfSubdomains 4;
simpleCoeffs
{
  delta 0.0001;
  n (2 2 1);
}
